Revit 2026 API

# AreaReinforcementCreate(Document, Element, IListCurve, XYZ, ElementId, ElementId, ElementId) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static AreaReinforcement Create(
	Document document,
	Element hostElement,
	IList<Curve> curveArray,
	XYZ majorDirection,
	ElementId areaReinforcementTypeId,
	ElementId rebarBarTypeId,
	ElementId rebarHookTypeId
)
```
```vb
Public Shared Function Create (
	document As Document,
	hostElement As Element,
	curveArray As IList(Of Curve),
	majorDirection As XYZ,
	areaReinforcementTypeId As ElementId,
	rebarBarTypeId As ElementId,
	rebarHookTypeId As ElementId
) As AreaReinforcement
```
```cpp
public:
static AreaReinforcement^ Create(
	Document^ document,
	Element^ hostElement,
	IList<Curve^>^ curveArray,
	XYZ^ majorDirection,
	ElementId^ areaReinforcementTypeId,
	ElementId^ rebarBarTypeId,
	ElementId^ rebarHookTypeId
)
```
```fsharp
static member Create :
        document : Document *
        hostElement : Element *
        curveArray : IList<Curve> *
        majorDirection : XYZ *
        areaReinforcementTypeId : ElementId *
        rebarBarTypeId : ElementId *
        rebarHookTypeId : ElementId -> AreaReinforcement
```

#### Parameters

document Document

hostElement Element

curveArray IListCurve

majorDirection XYZ

areaReinforcementTypeId ElementId

rebarBarTypeId ElementId

rebarHookTypeId ElementId

#### Return Value

AreaReinforcement

#### Reference

AreaReinforcement Class

Create Overload

Autodesk.Revit.DB.Structure Namespace